_org/Xposed源码分析.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-29 一 13:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Xopsed框架源码分析</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="tiankai" />
<meta name="description" content="Xposed 源码"
 />
</head>
<body>
<div id="content">
<h1 class="title">Xopsed框架源码分析</h1>

<div id="outline-container-orgda83f84" class="outline-2">
<h2 id="orgda83f84">xposed框架源码的介绍</h2>
<div class="outline-text-2" id="text-orgda83f84">
<p>
关于Xposed框架能够完成的功能就不在本文中进行介绍,如果想了解Xposed框架的功能可以自行进行搜索,网上有很多的资料.本文是根据自己的理解对Xposed的源码进行简单分析,以期理解Xposed框架背后的实现的原理.
</p>

<p>
首先从github中的Xposed主页中可以看到.Xposed,XposedBridge,XposedInstaller和XposedTools.
</p>
<ol class="org-ol">
<li>Xposed: Xposed框架实现Hook功能的c++部分的源码</li>
<li>XposedBridge: Xposed框架实现Hook功能的Java部分的源码</li>
<li>XposedInstaller: Xposed框架中负责对Xposed的运行环境进行安装配置和对Xposed的Moudle进行管理的Android程序.</li>
<li>XposedTools: 主要负责Xposed各个工程的编译.主要是由于Xoposed由很多部分构成,每一部分的编译还不一致,容易造成问题.</li>
</ol>

<p>
以上的各个部分都是Xposed框架重要的组成部分,并且通过相互的合作,一起完成Xposed框架的各种重要的功能.所以在研究源码的过程中经常出现从一个工程中的代码跳转到另一个工程中的代码的情况.这给源码的分析造成了一定的困难.而且在研究Xposed各个工程中的源码时发现,发现最新版本的Xposed框架的代码比较大,而且阅读起来比较困难.可以选择一个早期版本进行研究.目前可以选择v65版本进行研究.这个版本中的源码比较简单,研究起来比较简单.
</p>
</div>
</div>
