_org/Xposed源码分析.html

<div id="outline-container-org5fe74e6" class="outline-2">
<h2 id="org5fe74e6">XposedInstaller源码分析</h2>
<div class="outline-text-2" id="text-org5fe74e6">
<p>
XposedInstaller是开发人员能够直接接触到的Xposed框架的管理程序,在Android4.4及以下版本可以通过直接安装XposedInstaller的方式安装Xposed框架,但是到了Android5.0及以上的版本中就只能实现在recovery模式下刷入XposedInstaller了.我们可以直接研究低版本的XposedInstaller的源码来了解XposedInstaller的原理.
这个工程中最重要的代码再InstallFragment.java文件中.其中核心的代码如下所示. 下面的代码比较简单,主要的工作有两个:
</p>
<ol class="org-ol">
<li>将XposedBridge.jar文件放在/system/framwork/文件夹中.</li>
<li>将Xposed重写的app<sub>process可执行文件覆盖原系统中的</sub>/system/bin/app<sub>process</sub>.</li>
</ol>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #bc6ec5; font-weight: bold;">install</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">installMode</span> = getInstallMode<span style="color: #bc6ec5;">()</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>startShell<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;

    <span style="color: #ce537a; font-weight: bold;">List</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">messages</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">LinkedList</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #bc6ec5;">&gt;()</span>;
    <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #7590db;">showAlert</span> = <span style="color: #a45bad;">true</span>;
    <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #bc6ec5;">{</span>
      messages.add<span style="color: #2d9574;">(</span>getString<span style="color: #67b11d;">(</span>R.string.sdcard_location, XposedApp.getInstance<span style="color: #b1951d;">()</span>.getExternalFilesDir<span style="color: #b1951d;">(</span><span style="color: #a45bad;">null</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;
      messages.add<span style="color: #2d9574;">(</span><span style="color: #2d9574;">""</span><span style="color: #2d9574;">)</span>;

      messages.add<span style="color: #2d9574;">(</span>getString<span style="color: #67b11d;">(</span>R.string.file_copying, <span style="color: #2d9574;">"Xposed-Disabler-Recovery.zip"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>AssetUtil.writeAssetToSdcardFile<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"Xposed-Disabler-Recovery.zip"</span>, <span style="color: #a45bad;">00644</span><span style="color: #67b11d;">)</span> == <span style="color: #a45bad;">null</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        messages.add<span style="color: #67b11d;">(</span><span style="color: #2d9574;">""</span><span style="color: #67b11d;">)</span>;
        messages.add<span style="color: #67b11d;">(</span>getString<span style="color: #b1951d;">(</span>R.string.file_extract_failed, <span style="color: #2d9574;">"Xposed-Disabler-Recovery.zip"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
      <span style="color: #2d9574;">}</span>

      <span style="color: #ce537a; font-weight: bold;">File</span> <span style="color: #7590db;">appProcessFile</span> = AssetUtil.writeAssetToFile<span style="color: #2d9574;">(</span>APP_PROCESS_NAME, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">File</span><span style="color: #67b11d;">(</span><span style="color: #a45bad;">XposedApp</span>.BASE_DIR + <span style="color: #2d9574;">"bin/app_process"</span><span style="color: #67b11d;">)</span>, <span style="color: #a45bad;">00700</span><span style="color: #2d9574;">)</span>;
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>appProcessFile == <span style="color: #a45bad;">null</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        showAlert<span style="color: #67b11d;">(</span>getString<span style="color: #b1951d;">(</span>R.string.file_extract_failed, <span style="color: #2d9574;">"app_process"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
      <span style="color: #2d9574;">}</span>

      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>installMode == INSTALL_MODE_NORMAL<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Normal installation</span>
        messages.add<span style="color: #67b11d;">(</span>getString<span style="color: #b1951d;">(</span>R.string.file_mounting_writable, <span style="color: #2d9574;">"/system"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>mRootUtil.executeWithBusybox<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"mount -o remount,rw /system"</span>, messages<span style="color: #b1951d;">)</span> != <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
          messages.add<span style="color: #b1951d;">(</span>getString<span style="color: #4f97d7;">(</span>R.string.file_mount_writable_failed, <span style="color: #2d9574;">"/system"</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>;
          messages.add<span style="color: #b1951d;">(</span>getString<span style="color: #4f97d7;">(</span>R.string.file_trying_to_continue<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>;
        <span style="color: #67b11d;">}</span>

        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">File</span><span style="color: #b1951d;">(</span><span style="color: #2d9574;">"/system/bin/app_process.orig"</span><span style="color: #b1951d;">)</span>.exists<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
          messages.add<span style="color: #b1951d;">(</span>getString<span style="color: #4f97d7;">(</span>R.string.file_backup_already_exists, <span style="color: #2d9574;">"/system/bin/app_process.orig"</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>;
        <span style="color: #67b11d;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #67b11d;">{</span>
          <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>mRootUtil.executeWithBusybox<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"cp -a /system/bin/app_process /system/bin/app_process.orig"</span>, messages<span style="color: #4f97d7;">)</span> != <span style="color: #a45bad;">0</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
            messages.add<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">""</span><span style="color: #4f97d7;">)</span>;
            messages.add<span style="color: #4f97d7;">(</span>getString<span style="color: #bc6ec5;">(</span>R.string.file_backup_failed, <span style="color: #2d9574;">"/system/bin/app_process"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
            <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
          <span style="color: #b1951d;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #b1951d;">{</span>
            messages.add<span style="color: #4f97d7;">(</span>getString<span style="color: #bc6ec5;">(</span>R.string.file_backup_successful, <span style="color: #2d9574;">"/system/bin/app_process.orig"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
          <span style="color: #b1951d;">}</span>

          mRootUtil.executeWithBusybox<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"sync"</span>, messages<span style="color: #b1951d;">)</span>;
        <span style="color: #67b11d;">}</span>

        messages.add<span style="color: #67b11d;">(</span>getString<span style="color: #b1951d;">(</span>R.string.file_copying, <span style="color: #2d9574;">"app_process"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>mRootUtil.executeWithBusybox<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"cp -a "</span> + appProcessFile.getAbsolutePath<span style="color: #4f97d7;">()</span> + <span style="color: #2d9574;">" /system/bin/app_process"</span>, messages<span style="color: #b1951d;">)</span> != <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
          messages.add<span style="color: #b1951d;">(</span><span style="color: #2d9574;">""</span><span style="color: #b1951d;">)</span>;
          messages.add<span style="color: #b1951d;">(</span>getString<span style="color: #4f97d7;">(</span>R.string.file_copy_failed, <span style="color: #2d9574;">"app_process"</span>, <span style="color: #2d9574;">"/system/bin"</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>;
          <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
        <span style="color: #67b11d;">}</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>mRootUtil.executeWithBusybox<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"chmod 755 /system/bin/app_process"</span>, messages<span style="color: #b1951d;">)</span> != <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
          messages.add<span style="color: #b1951d;">(</span><span style="color: #2d9574;">""</span><span style="color: #b1951d;">)</span>;
          messages.add<span style="color: #b1951d;">(</span>getString<span style="color: #4f97d7;">(</span>R.string.file_set_perms_failed, <span style="color: #2d9574;">"/system/bin/app_process"</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>;
          <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
        <span style="color: #67b11d;">}</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>mRootUtil.executeWithBusybox<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"chown root:shell /system/bin/app_process"</span>, messages<span style="color: #b1951d;">)</span> != <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
          messages.add<span style="color: #b1951d;">(</span><span style="color: #2d9574;">""</span><span style="color: #b1951d;">)</span>;
          messages.add<span style="color: #b1951d;">(</span>getString<span style="color: #4f97d7;">(</span>R.string.file_set_owner_failed, <span style="color: #2d9574;">"/system/bin/app_process"</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>;
          <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
        <span style="color: #67b11d;">}</span>

      <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>installMode == INSTALL_MODE_RECOVERY_AUTO<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #a45bad;">!</span>prepareAutoFlash<span style="color: #b1951d;">(</span>messages, <span style="color: #2d9574;">"Xposed-Installer-Recovery.zip"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
          <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;

      <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>installMode == INSTALL_MODE_RECOVERY_MANUAL<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #a45bad;">!</span>prepareManualFlash<span style="color: #b1951d;">(</span>messages, <span style="color: #2d9574;">"Xposed-Installer-Recovery.zip"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
          <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
      <span style="color: #2d9574;">}</span>

      <span style="color: #ce537a; font-weight: bold;">File</span> <span style="color: #7590db;">blocker</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">File</span><span style="color: #2d9574;">(</span><span style="color: #a45bad;">XposedApp</span>.BASE_DIR + <span style="color: #2d9574;">"conf/disabled"</span><span style="color: #2d9574;">)</span>;
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>blocker.exists<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        messages.add<span style="color: #67b11d;">(</span>getString<span style="color: #b1951d;">(</span>R.string.file_removing, blocker.getAbsolutePath<span style="color: #4f97d7;">()</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>mRootUtil.executeWithBusybox<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"rm "</span> + blocker.getAbsolutePath<span style="color: #4f97d7;">()</span>, messages<span style="color: #b1951d;">)</span> != <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
          messages.add<span style="color: #b1951d;">(</span><span style="color: #2d9574;">""</span><span style="color: #b1951d;">)</span>;
          messages.add<span style="color: #b1951d;">(</span>getString<span style="color: #4f97d7;">(</span>R.string.file_remove_failed, blocker.getAbsolutePath<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>;
          <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
        <span style="color: #67b11d;">}</span>
      <span style="color: #2d9574;">}</span>

      messages.add<span style="color: #2d9574;">(</span>getString<span style="color: #67b11d;">(</span>R.string.file_copying, <span style="color: #2d9574;">"XposedBridge.jar"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;
      <span style="color: #ce537a; font-weight: bold;">File</span> <span style="color: #7590db;">jarFile</span> = AssetUtil.writeAssetToFile<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"XposedBridge.jar"</span>, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">File</span><span style="color: #67b11d;">(</span>JAR_PATH_NEWVERSION<span style="color: #67b11d;">)</span>, <span style="color: #a45bad;">00644</span><span style="color: #2d9574;">)</span>;
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>jarFile == <span style="color: #a45bad;">null</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        messages.add<span style="color: #67b11d;">(</span><span style="color: #2d9574;">""</span><span style="color: #67b11d;">)</span>;
        messages.add<span style="color: #67b11d;">(</span>getString<span style="color: #b1951d;">(</span>R.string.file_extract_failed, <span style="color: #2d9574;">"XposedBridge.jar"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
      <span style="color: #2d9574;">}</span>

      mRootUtil.executeWithBusybox<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"sync"</span>, messages<span style="color: #2d9574;">)</span>;

      showAlert = <span style="color: #a45bad;">false</span>;
      messages.add<span style="color: #2d9574;">(</span><span style="color: #2d9574;">""</span><span style="color: #2d9574;">)</span>;
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>installMode == INSTALL_MODE_NORMAL<span style="color: #2d9574;">)</span>
        offerReboot<span style="color: #2d9574;">(</span>messages<span style="color: #2d9574;">)</span>;
      <span style="color: #4f97d7; font-weight: bold;">else</span>
        offerRebootToRecovery<span style="color: #2d9574;">(</span>messages, <span style="color: #2d9574;">"Xposed-Installer-Recovery.zip"</span>, installMode<span style="color: #2d9574;">)</span>;

      <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">true</span>;

    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">finally</span> <span style="color: #bc6ec5;">{</span>
      AssetUtil.removeBusybox<span style="color: #2d9574;">()</span>;

      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>showAlert<span style="color: #2d9574;">)</span>
        showAlert<span style="color: #2d9574;">(</span>TextUtils.join<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"\n"</span>, messages<span style="color: #67b11d;">)</span>.trim<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7;">}</span>
</pre>
</div>


<p>
XposedInstaller中的其他代码主要是进行模块(module)的管理等工作,对研究Xposed框架的核心功能影响不大,所以本文不详细进行研究.
</p>
</div>
</div>
