_org/Xposed源码分析.html


<div id="outline-container-org514e618" class="outline-2">
<h2 id="org514e618">Xposed(Native)源码的分析</h2>
<div class="outline-text-2" id="text-org514e618">
<p>
Xposed工程中的开始文件是app<sub>main.cpp这个文件.这个文件的大部分的代码和Android源码中的</sub>/frameworks/base/cmds/app<sub>process</sub>/app<sub>main.cpp中的代码一致</sub>.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">argc</span>, <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">argv</span><span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">xposed</span>::handleOptions<span style="color: #2d9574;">(</span>argc, argv<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">......</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">......&#20195;&#30721;&#30465;&#30053;</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">......</span>

    runtime.mParentDir = parentDir;
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNING-1: initialize&#30340;&#20027;&#35201;&#21151;&#33021;&#26159;&#23558;XposedBridge.jar&#21253;&#25918;&#22312;&#31995;&#32479;&#30340;&#29615;&#22659;&#21464;&#37327;CLASSPATH&#20013;.&#20197;&#20415;&#20110;&#21518;&#26399;&#30340;&#21152;&#36733;.</span>
    isXposedLoaded = <span style="color: #a45bad;">xposed</span>::initialize<span style="color: #bc6ec5;">(</span>zygote, startSystemServer, className, argc, argv<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>zygote<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNING-2: &#35843;&#29992;de.robv.android.xposed.XposedBridge&#31867;&#20013;&#30340;main&#26041;&#27861;.</span>
        runtime.start<span style="color: #2d9574;">(</span>isXposedLoaded ? XPOSED_CLASS_DOTS_ZYGOTE : <span style="color: #2d9574;">"com.android.internal.os.ZygoteInit"</span>,
                startSystemServer ? <span style="color: #2d9574;">"start-system-server"</span> : <span style="color: #2d9574;">""</span><span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>className<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        runtime.mClassName = className;
        runtime.mArgC = argc - i;
        runtime.mArgV = argv + i;
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNGING-3: &#35843;&#29992;de.robv.android.xposed.XposedBridge$ToolEntryPoint&#20013;&#30340;main&#26041;&#27861;.</span>
        runtime.start<span style="color: #2d9574;">(</span>isXposedLoaded ? XPOSED_CLASS_DOTS_TOOLS : <span style="color: #2d9574;">"com.android.internal.os.RuntimeInit"</span>,
                application ? <span style="color: #2d9574;">"application"</span> : <span style="color: #2d9574;">"tool"</span><span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
        fprintf<span style="color: #2d9574;">(</span>stderr, <span style="color: #2d9574;">"Error: no class name or --zygote supplied.\n"</span><span style="color: #2d9574;">)</span>;
        app_usage<span style="color: #2d9574;">()</span>;
        LOG_ALWAYS_FATAL<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"app_process: no class name or --zygote supplied."</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">10</span>;
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Xposed中还有一部分的代码非常重要那就是onVmcreated(JNIEnv* env). 从上面的代码中可以看到函数调用的是runtime.start方法,而runtime是AppRuntime类型的对象.在Android源码中AppRuntime是集成自AndroidRuntime的类,并且AppRuntime本身没有重写start方法.所以rutime.start方法调用的实际上是Android.start中的方法.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #a45bad;">AndroidRuntime</span>::<span style="color: #bc6ec5; font-weight: bold;">start</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">className</span>, <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">options</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNING-1:&#35843;&#29992;&#23376;&#31867;&#30340;onVMCreate&#26041;&#27861;</span>
    onVmCreated<span style="color: #bc6ec5;">(</span>env<span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * Register android functions.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     */</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>startReg<span style="color: #2d9574;">(</span>env<span style="color: #2d9574;">)</span> &lt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        LOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Unable to register all android natives\n"</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * We want to call main() with a String array with arguments in it.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * At present we have two arguments, the class name and an option string.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * Create an array to hold them.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     */</span>
    <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">stringClass</span>;
    <span style="color: #ce537a; font-weight: bold;">jobjectArray</span> <span style="color: #7590db;">strArray</span>;
    <span style="color: #ce537a; font-weight: bold;">jstring</span> <span style="color: #7590db;">classNameStr</span>;
    <span style="color: #ce537a; font-weight: bold;">jstring</span> <span style="color: #7590db;">optionsStr</span>;

    stringClass = env-&gt;FindClass<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"java/lang/String"</span><span style="color: #bc6ec5;">)</span>;
    assert<span style="color: #bc6ec5;">(</span>stringClass != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;
    strArray = env-&gt;NewObjectArray<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span>, stringClass, <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;
    assert<span style="color: #bc6ec5;">(</span>strArray != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;
    classNameStr = env-&gt;NewStringUTF<span style="color: #bc6ec5;">(</span>className<span style="color: #bc6ec5;">)</span>;
    assert<span style="color: #bc6ec5;">(</span>classNameStr != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;
    env-&gt;SetObjectArrayElement<span style="color: #bc6ec5;">(</span>strArray, <span style="color: #a45bad;">0</span>, classNameStr<span style="color: #bc6ec5;">)</span>;
    optionsStr = env-&gt;NewStringUTF<span style="color: #bc6ec5;">(</span>options<span style="color: #bc6ec5;">)</span>;
    env-&gt;SetObjectArrayElement<span style="color: #bc6ec5;">(</span>strArray, <span style="color: #a45bad;">1</span>, optionsStr<span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * Start VM.  This thread becomes the main thread of the VM, and will</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * not return until the VM exits.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     */</span>
    <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">slashClassName</span> = toSlashClassName<span style="color: #bc6ec5;">(</span>className<span style="color: #bc6ec5;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">startClass</span> = env-&gt;FindClass<span style="color: #bc6ec5;">(</span>slashClassName<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>startClass == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        LOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"JavaVM unable to locate class '%s'\n"</span>, slashClassName<span style="color: #2d9574;">)</span>;
        <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">keep going */</span>
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #ce537a; font-weight: bold;">jmethodID</span> <span style="color: #7590db;">startMeth</span> = env-&gt;GetStaticMethodID<span style="color: #2d9574;">(</span>startClass, <span style="color: #2d9574;">"main"</span>,
            <span style="color: #2d9574;">"([Ljava/lang/String;)V"</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>startMeth == <span style="color: #a45bad;">NULL</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            LOGE<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"JavaVM unable to find main() in '%s'\n"</span>, className<span style="color: #67b11d;">)</span>;
            <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">keep going */</span>
        <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2d9574;">{</span>
            env-&gt;CallStaticVoidMethod<span style="color: #67b11d;">(</span>startClass, startMeth, strArray<span style="color: #67b11d;">)</span>;

<span style="color: #bc6ec5;">#if</span> <span style="color: #a45bad;">0</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>env-&gt;ExceptionCheck<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span>
                threadExitUncaughtException<span style="color: #67b11d;">(</span>env<span style="color: #67b11d;">)</span>;
<span style="color: #bc6ec5;">#endif</span>
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
    free<span style="color: #bc6ec5;">(</span>slashClassName<span style="color: #bc6ec5;">)</span>;

    LOGD<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Shutting down VM\n"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mJavaVM-&gt;DetachCurrentThread<span style="color: #2d9574;">()</span> != JNI_OK<span style="color: #bc6ec5;">)</span>
        LOGW<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Warning: unable to detach main thread\n"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mJavaVM-&gt;DestroyJavaVM<span style="color: #2d9574;">()</span> != <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span>
        LOGW<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Warning: VM did not shut down cleanly\n"</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

</pre>
</div>

<p>
由于Xposed中重写了AppRuntime中的onVmCreate方法,实际上是调用的就是AppRuntime中的方法,具体的代码如下所示:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #4f97d7; font-weight: bold;">virtual</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">onVmCreated</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span>* <span style="color: #7590db;">env</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#35843;&#29992;&#30340;&#26159;Xposed&#31867;&#20013;&#30340;onVmCreated&#26041;&#27861;</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>isXposedLoaded<span style="color: #bc6ec5;">)</span>
        <span style="color: #a45bad;">xposed</span>::onVmCreated<span style="color: #bc6ec5;">(</span>env<span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mClassName == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Zygote. Nothing to do here.</span>
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #2aa1ae; background-color: #292e34;">/*</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * This is a little awkward because the JNI FindClass call uses the</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * class loader associated with the native method we're executing in.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * If called in onStarted (from RuntimeInit.finishInit because we're</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * launching "am", for example), FindClass would see that we're calling</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * from a boot class' native method, and so wouldn't look for the class</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * we're trying to look up in CLASSPATH. Unfortunately it needs to,</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * because the "am" classes are not boot classes.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     *</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * The easiest fix is to call FindClass here, early on before we start</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * executing boot class Java code and thereby deny ourselves access to</span>
<span style="color: #2aa1ae; background-color: #292e34;">     * non-boot classes.</span>
<span style="color: #2aa1ae; background-color: #292e34;">     */</span>
    <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">slashClassName</span> = toSlashClassName<span style="color: #bc6ec5;">(</span>mClassName<span style="color: #bc6ec5;">)</span>;
    mClass = env-&gt;FindClass<span style="color: #bc6ec5;">(</span>slashClassName<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>mClass == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"ERROR: could not find class '%s'\n"</span>, mClassName<span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
    free<span style="color: #bc6ec5;">(</span>slashClassName<span style="color: #bc6ec5;">)</span>;

    mClass = <span style="color: #4f97d7; font-weight: bold;">reinterpret_cast</span><span style="color: #bc6ec5;">&lt;</span>jclass<span style="color: #bc6ec5;">&gt;(</span>env-&gt;NewGlobalRef<span style="color: #2d9574;">(</span>mClass<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Xposed中的onVmCreate方法定义在xposed.cpp中,该方法的代码如下所示.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">onVmCreated</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span>* <span style="color: #7590db;">env</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>initMemberOffsets<span style="color: #2d9574;">(</span>env<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span>;

    <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">classMiuiResources</span> = env-&gt;FindClass<span style="color: #bc6ec5;">(</span>CLASS_MIUI_RESOURCES<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>classMiuiResources != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #ce537a; font-weight: bold;">ClassObject</span>* <span style="color: #7590db;">clazz</span> = <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">ClassObject</span>*<span style="color: #2d9574;">)</span>dvmDecodeIndirectRef<span style="color: #2d9574;">(</span>dvmThreadSelf<span style="color: #67b11d;">()</span>, classMiuiResources<span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>dvmIsFinalClass<span style="color: #67b11d;">(</span>clazz<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            ALOGD<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"Removing final flag for class '%s'"</span>, CLASS_MIUI_RESOURCES<span style="color: #67b11d;">)</span>;
            clazz-&gt;accessFlags &amp;= ~ACC_FINAL;
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
    env-&gt;ExceptionClear<span style="color: #bc6ec5;">()</span>;

    <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">classXTypedArray</span> = env-&gt;FindClass<span style="color: #bc6ec5;">(</span>CLASS_XTYPED_ARRAY<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>classXTypedArray == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Error while loading XTypedArray class '%s':"</span>, CLASS_XTYPED_ARRAY<span style="color: #2d9574;">)</span>;
        dvmLogExceptionStackTrace<span style="color: #2d9574;">()</span>;
        env-&gt;ExceptionClear<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span>;
    <span style="color: #bc6ec5;">}</span>
    prepareSubclassReplacement<span style="color: #bc6ec5;">(</span>classXTypedArray<span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNING: &#27880;&#20876;Xposed&#30340;native&#26041;&#27861;.</span>
    classXposedBridge = env-&gt;FindClass<span style="color: #bc6ec5;">(</span>CLASS_XPOSED_BRIDGE<span style="color: #bc6ec5;">)</span>;
    classXposedBridge = <span style="color: #4f97d7; font-weight: bold;">reinterpret_cast</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">jclass</span><span style="color: #bc6ec5;">&gt;(</span>env-&gt;NewGlobalRef<span style="color: #2d9574;">(</span>classXposedBridge<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>classXposedBridge == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Error while loading Xposed class '%s':"</span>, CLASS_XPOSED_BRIDGE<span style="color: #2d9574;">)</span>;
        dvmLogExceptionStackTrace<span style="color: #2d9574;">()</span>;
        env-&gt;ExceptionClear<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span>;
    <span style="color: #bc6ec5;">}</span>

    ALOGI<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Found Xposed class '%s', now initializing"</span>, CLASS_XPOSED_BRIDGE<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>register_natives_XposedBridge<span style="color: #2d9574;">(</span>env, classXposedBridge<span style="color: #2d9574;">)</span> != JNI_OK<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Could not register natives for '%s'"</span>, CLASS_XPOSED_BRIDGE<span style="color: #2d9574;">)</span>;
        dvmLogExceptionStackTrace<span style="color: #2d9574;">()</span>;
        env-&gt;ExceptionClear<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span>;
    <span style="color: #bc6ec5;">}</span>

    xposedLoadedSuccessfully = <span style="color: #a45bad;">true</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
该方法主要进行的xposed常用native方法的注册,注册的方法如下所示:
</p>
<div class="org-src-container">
<pre class="src src-C++">        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, getStartClassName, <span style="color: #2d9574;">"()Ljava/lang/String;"</span><span style="color: #4f97d7;">)</span>,
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, getRuntime, <span style="color: #2d9574;">"()I"</span><span style="color: #4f97d7;">)</span>,
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, startsSystemServer, <span style="color: #2d9574;">"()Z"</span><span style="color: #4f97d7;">)</span>,
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, getXposedVersion, <span style="color: #2d9574;">"()I"</span><span style="color: #4f97d7;">)</span>,
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, initNative, <span style="color: #2d9574;">"()Z"</span><span style="color: #4f97d7;">)</span>,
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, hookMethodNative, <span style="color: #2d9574;">"(Ljava/lang/reflect/Member;Ljava/lang/Class;ILjava/lang/Object;)V"</span><span style="color: #4f97d7;">)</span>,
<span style="color: #bc6ec5;">#ifdef</span> ART_TARGET
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, invokeOriginalMethodNative,
            <span style="color: #2d9574;">"(Ljava/lang/reflect/Member;I[Ljava/lang/Class;Ljava/lang/Class;Ljava/lang/Object;[Ljava/lang/Object;)Ljava/lang/Object;"</span><span style="color: #4f97d7;">)</span>,
<span style="color: #bc6ec5;">#endif</span>
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, setObjectClassNative, <span style="color: #2d9574;">"(Ljava/lang/Object;Ljava/lang/Class;)V"</span><span style="color: #4f97d7;">)</span>,
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, dumpObjectNative, <span style="color: #2d9574;">"(Ljava/lang/Object;)V"</span><span style="color: #4f97d7;">)</span>,
        NATIVE_METHOD<span style="color: #4f97d7;">(</span>XposedBridge, cloneToSubclassNative, <span style="color: #2d9574;">"(Ljava/lang/Object;Ljava/lang/Class;)Ljava/lang/Object;"</span><span style="color: #4f97d7;">)</span>,

</pre>
</div>
</div>
</div>
