_org/Xposed源码分析.html

<div id="outline-container-orgfe7381d" class="outline-2">
<h2 id="orgfe7381d">XposedBridge源码分析</h2>
<div class="outline-text-2" id="text-orgfe7381d">
<p>
通过上一部分的分析,可以发现Xposed(native)的代码需要调用XposedBrige中的代码,所以本部分会对XposedBridge中的代码进行分析,而且分析过程中XposedBridge中的代码还会调用Xposed中的代码.首先来看de.robv.android.xposed.XposedBridge中的main方法.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #bc6ec5;">[]</span> <span style="color: #7590db;">args</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Initialize the Xposed framework and modules</span>
    <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #bc6ec5;">{</span>
      SELinuxHelper.initOnce<span style="color: #2d9574;">()</span>;
      SELinuxHelper.initForProcess<span style="color: #2d9574;">(</span><span style="color: #a45bad;">null</span><span style="color: #2d9574;">)</span>;

      runtime = getRuntime<span style="color: #2d9574;">()</span>;
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNING-1:&#35843;&#29992;initNative&#30340;&#26041;&#27861;</span>
      <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>initNative<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        XPOSED_BRIDGE_VERSION = getXposedVersion<span style="color: #67b11d;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>isZygote<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
          startsSystemServer = startsSystemServer<span style="color: #b1951d;">()</span>;
          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNING-2:&#35843;&#29992;initForZygote&#26041;&#27861;</span>
          initForZygote<span style="color: #b1951d;">()</span>;
        <span style="color: #67b11d;">}</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Warning-3: &#35843;&#29992;LoadModules&#27169;&#22359;,&#21152;&#36733;XposedInstaller&#20013;&#30340;&#27169;&#22359;</span>
        loadModules<span style="color: #67b11d;">()</span>;
      <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2d9574;">{</span>
        log<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"Errors during native Xposed initialization"</span><span style="color: #67b11d;">)</span>;
      <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Throwable</span> <span style="color: #7590db;">t</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
      log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Errors during Xposed initialization"</span><span style="color: #2d9574;">)</span>;
      log<span style="color: #2d9574;">(</span>t<span style="color: #2d9574;">)</span>;
      disableHooks = <span style="color: #a45bad;">true</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Call the original startup code</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#35843;&#29992;com.android.internal.os.ZygoteInit.main&#30340;&#20195;&#30721;, &#22238;&#21040;&#21407;&#22987;&#30340;&#36923;&#36753;&#36827;&#34892;&#25191;&#34892;</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>isZygote<span style="color: #bc6ec5;">)</span>
      ZygoteInit.main<span style="color: #bc6ec5;">(</span>args<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">else</span>
      RuntimeInit.main<span style="color: #bc6ec5;">(</span>args<span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
先来看initNative的源码,通过研究发现initNative的函数定义如下:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #4f97d7; font-weight: bold;">private</span> native <span style="color: #4f97d7; font-weight: bold;">static</span> boolean initNative<span style="color: #4f97d7;">()</span>;
</pre>
</div>
<p>
从该函数的声明中可以发现,该方法是native方法.所以通过对Xposed(native)的代码的查找.找到了该函数的具体的实现.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ce537a; font-weight: bold;">jboolean</span> <span style="color: #bc6ec5; font-weight: bold;">XposedBridge_initNative</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span>* <span style="color: #7590db;">env</span>, <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">clazz</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>xposedLoadedSuccessfully<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Not initializing Xposed because of previous errors"</span><span style="color: #2d9574;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNING: &#20851;&#38190;&#30340;&#20195;&#30721;</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>callback_XposedBridge_initNative<span style="color: #2d9574;">(</span>env<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.....</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
继续往下追踪:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ce537a; font-weight: bold;">jboolean</span> <span style="color: #bc6ec5; font-weight: bold;">callback_XposedBridge_initNative</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span>* <span style="color: #7590db;">env</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">WARNING: &#33719;&#21462;XposedBridge.jar&#20013;&#30340;handleHookedMethod&#26041;&#27861;,&#24182;&#23558;&#35813;&#26041;&#27861;&#36171;&#20540;&#32473;xposedHandleHookedMethod</span>
    xposedHandleHookedMethod = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Method</span>*<span style="color: #bc6ec5;">)</span> env-&gt;GetStaticMethodID<span style="color: #bc6ec5;">(</span>classXposedBridge, <span style="color: #2d9574;">"handleHookedMethod"</span>,
        <span style="color: #2d9574;">"(Ljava/lang/reflect/Member;ILjava/lang/Object;Ljava/lang/Object;[Ljava/lang/Object;)Ljava/lang/Object;"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>xposedHandleHookedMethod == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"ERROR: could not find method %s.handleHookedMethod(Member, int, Object, Object, Object[])"</span>, CLASS_XPOSED_BRIDGE<span style="color: #2d9574;">)</span>;
        dvmLogExceptionStackTrace<span style="color: #2d9574;">()</span>;
        env-&gt;ExceptionClear<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#33719;&#21462;&#21040;invokeOriginalMethodNative&#26041;&#27861;,&#24182;&#23558;&#35813;&#26041;&#27861;&#36171;&#20540;&#32473;invokeOrignalMethodNative&#26041;&#27861;</span>
    <span style="color: #ce537a; font-weight: bold;">Method</span>* <span style="color: #7590db;">xposedInvokeOriginalMethodNative</span> = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">Method</span>*<span style="color: #bc6ec5;">)</span> env-&gt;GetStaticMethodID<span style="color: #bc6ec5;">(</span>classXposedBridge, <span style="color: #2d9574;">"invokeOriginalMethodNative"</span>,
        <span style="color: #2d9574;">"(Ljava/lang/reflect/Member;I[Ljava/lang/Class;Ljava/lang/Class;Ljava/lang/Object;[Ljava/lang/Object;)Ljava/lang/Object;"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>xposedInvokeOriginalMethodNative == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"ERROR: could not find method %s.invokeOriginalMethodNative(Member, int, Class[], Class, Object, Object[])"</span>, CLASS_XPOSED_BRIDGE<span style="color: #2d9574;">)</span>;
        dvmLogExceptionStackTrace<span style="color: #2d9574;">()</span>;
        env-&gt;ExceptionClear<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
    <span style="color: #bc6ec5;">}</span>
    dvmSetNativeFunc<span style="color: #bc6ec5;">(</span>xposedInvokeOriginalMethodNative, XposedBridge_invokeOriginalMethodNative, <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;

    objectArrayClass = dvmFindArrayClass<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"[Ljava/lang/Object;"</span>, <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>objectArrayClass == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        ALOGE<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Error while loading Object[] class"</span><span style="color: #2d9574;">)</span>;
        dvmLogExceptionStackTrace<span style="color: #2d9574;">()</span>;
        env-&gt;ExceptionClear<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">true</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
上面的方法总结起来只有一个功能,从XposedBrige.jar包中获取关键的两个方法,然后将这两个方法赋值给native代码的两个全局变量,以便于后期使用.
</p>


<p>
接下来继续研究XposedBrige.jar中的第一个main方法.该方法后续调用了initForZygote()方法.该方法的实现如下所示:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">/**</span>
<span style="color: #2aa1ae; background-color: #292e34;">   * Hook some methods which we want to create an easier interface for developers.</span>
<span style="color: #2aa1ae; background-color: #292e34;">   */</span>
  <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> initForZygote<span style="color: #4f97d7;">()</span> <span style="color: #ce537a; font-weight: bold;">throws</span> <span style="color: #7590db;">Throwable</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">HashSet</span><span style="color: #bc6ec5;">&lt;</span>String<span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">loadedPackagesInProcess</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> HashSet<span style="color: #bc6ec5;">&lt;</span>String<span style="color: #bc6ec5;">&gt;(</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">normal process initialization (for new Activity, Service, BroadcastReceiver etc.)</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Hook Android&#31995;&#32479;&#30340;HandleBindApplication&#26041;&#27861;</span>
    findAndHookMethod<span style="color: #bc6ec5;">(</span>ActivityThread.<span style="color: #4f97d7; font-weight: bold;">class</span>, <span style="color: #2d9574;">"handleBindApplication"</span>, <span style="color: #2d9574;">"android.app.ActivityThread.AppBindData"</span>, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">XC_MethodHook</span><span style="color: #2d9574;">()</span> <span style="color: #2d9574;">{</span>
      <span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #ce537a; font-weight: bold;">void</span> beforeHookedMethod<span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">MethodHookParam</span> <span style="color: #7590db;">param</span><span style="color: #67b11d;">)</span> <span style="color: #ce537a; font-weight: bold;">throws</span> <span style="color: #7590db;">Throwable</span> <span style="color: #67b11d;">{</span>
        <span style="color: #ce537a; font-weight: bold;">ActivityThread</span> <span style="color: #7590db;">activityThread</span> = <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">ActivityThread</span><span style="color: #b1951d;">)</span> param.thisObject;
        <span style="color: #ce537a; font-weight: bold;">ApplicationInfo</span> <span style="color: #7590db;">appInfo</span> = <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">ApplicationInfo</span><span style="color: #b1951d;">)</span> getObjectField<span style="color: #b1951d;">(</span>param.args<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span>, <span style="color: #2d9574;">"appInfo"</span><span style="color: #b1951d;">)</span>;
        <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">reportedPackageName</span> = appInfo.packageName.equals<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"android"</span><span style="color: #b1951d;">)</span> ? <span style="color: #2d9574;">"system"</span> : appInfo.packageName;
        SELinuxHelper.initForProcess<span style="color: #b1951d;">(</span>reportedPackageName<span style="color: #b1951d;">)</span>;
        <span style="color: #ce537a; font-weight: bold;">ComponentName</span> <span style="color: #7590db;">instrumentationName</span> = <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">ComponentName</span><span style="color: #b1951d;">)</span> getObjectField<span style="color: #b1951d;">(</span>param.args<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span>, <span style="color: #2d9574;">"instrumentationName"</span><span style="color: #b1951d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>instrumentationName != null<span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
          XposedBridge.log<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Instrumentation detected, disabling framework for "</span> + reportedPackageName<span style="color: #4f97d7;">)</span>;
          disableHooks = <span style="color: #a45bad;">true</span>;
          <span style="color: #4f97d7; font-weight: bold;">return</span>;
        <span style="color: #b1951d;">}</span>
        <span style="color: #ce537a; font-weight: bold;">CompatibilityInfo</span> <span style="color: #7590db;">compatInfo</span> = <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">CompatibilityInfo</span><span style="color: #b1951d;">)</span> getObjectField<span style="color: #b1951d;">(</span>param.args<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span>, <span style="color: #2d9574;">"compatInfo"</span><span style="color: #b1951d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>appInfo.sourceDir == null<span style="color: #b1951d;">)</span>
          <span style="color: #4f97d7; font-weight: bold;">return</span>;

        setObjectField<span style="color: #b1951d;">(</span>activityThread, <span style="color: #2d9574;">"mBoundApplication"</span>, param.args<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span><span style="color: #b1951d;">)</span>;
        loadedPackagesInProcess.add<span style="color: #b1951d;">(</span>reportedPackageName<span style="color: #b1951d;">)</span>;
        <span style="color: #ce537a; font-weight: bold;">LoadedApk</span> <span style="color: #7590db;">loadedApk</span> = activityThread.getPackageInfoNoCheck<span style="color: #b1951d;">(</span>appInfo, compatInfo<span style="color: #b1951d;">)</span>;
        XResources.setPackageNameForResDir<span style="color: #b1951d;">(</span>appInfo.packageName, loadedApk.getResDir<span style="color: #4f97d7;">()</span><span style="color: #b1951d;">)</span>;

        <span style="color: #ce537a; font-weight: bold;">LoadPackageParam</span> <span style="color: #7590db;">lpparam</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">LoadPackageParam</span><span style="color: #b1951d;">(</span>sLoadedPackageCallbacks<span style="color: #b1951d;">)</span>;
        lpparam.packageName = reportedPackageName;
        lpparam.processName = <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #b1951d;">)</span> getObjectField<span style="color: #b1951d;">(</span>param.args<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span>, <span style="color: #2d9574;">"processName"</span><span style="color: #b1951d;">)</span>;
        lpparam.classLoader = loadedApk.getClassLoader<span style="color: #b1951d;">()</span>;
        lpparam.appInfo = appInfo;
        lpparam.isFirstApplication = <span style="color: #a45bad;">true</span>;
        XC_LoadPackage.callAll<span style="color: #b1951d;">(</span>lpparam<span style="color: #b1951d;">)</span>;

        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>reportedPackageName.equals<span style="color: #4f97d7;">(</span>INSTALLER_PACKAGE_NAME<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
          hookXposedInstaller<span style="color: #b1951d;">(</span>lpparam.classLoader<span style="color: #b1951d;">)</span>;
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span>;

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">system_server initialization</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>Build.VERSION.SDK_INT &lt; <span style="color: #a45bad;">21</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#31995;&#32479;&lt; 21,&#23601;hook&#31995;&#32479;&#30340;com.android.server.ServerThread&#26041;&#27861;</span>
      findAndHookMethod<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"com.android.server.ServerThread"</span>, null,
          Build.VERSION.SDK_INT &lt; <span style="color: #a45bad;">19</span> ? <span style="color: #2d9574;">"run"</span> : <span style="color: #2d9574;">"initAndLoop"</span>, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">XC_MethodHook</span><span style="color: #67b11d;">()</span> <span style="color: #67b11d;">{</span>
        @Override
        <span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #ce537a; font-weight: bold;">void</span> beforeHookedMethod<span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">MethodHookParam</span> <span style="color: #7590db;">param</span><span style="color: #b1951d;">)</span> <span style="color: #ce537a; font-weight: bold;">throws</span> <span style="color: #7590db;">Throwable</span> <span style="color: #b1951d;">{</span>
          SELinuxHelper.initForProcess<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"android"</span><span style="color: #4f97d7;">)</span>;
          loadedPackagesInProcess.add<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"android"</span><span style="color: #4f97d7;">)</span>;

          <span style="color: #ce537a; font-weight: bold;">LoadPackageParam</span> <span style="color: #7590db;">lpparam</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">LoadPackageParam</span><span style="color: #4f97d7;">(</span>sLoadedPackageCallbacks<span style="color: #4f97d7;">)</span>;
          lpparam.packageName = <span style="color: #2d9574;">"android"</span>;
          lpparam.processName = <span style="color: #2d9574;">"android"</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">it's actually system_server, but other functions return this as well</span>
          lpparam.classLoader = BOOTCLASSLOADER;
          lpparam.appInfo = null;
          lpparam.isFirstApplication = <span style="color: #a45bad;">true</span>;
          XC_LoadPackage.callAll<span style="color: #4f97d7;">(</span>lpparam<span style="color: #4f97d7;">)</span>;
        <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>startsSystemServer<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#31995;&#32479;&#29256;&#26412;&#22823;&#20110; 21.&#21017;hook&#31995;&#32479;&#30340;system&#26041;&#27861;</span>
      findAndHookMethod<span style="color: #2d9574;">(</span>ActivityThread.<span style="color: #4f97d7; font-weight: bold;">class</span>, <span style="color: #2d9574;">"systemMain"</span>, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">XC_MethodHook</span><span style="color: #67b11d;">()</span> <span style="color: #67b11d;">{</span>
        @Override
        <span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #ce537a; font-weight: bold;">void</span> afterHookedMethod<span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">MethodHookParam</span> <span style="color: #7590db;">param</span><span style="color: #b1951d;">)</span> <span style="color: #ce537a; font-weight: bold;">throws</span> <span style="color: #7590db;">Throwable</span> <span style="color: #b1951d;">{</span>
          <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">ClassLoader</span> <span style="color: #7590db;">cl</span> = Thread.currentThread<span style="color: #4f97d7;">()</span>.getContextClassLoader<span style="color: #4f97d7;">()</span>;
          findAndHookMethod<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"com.android.server.SystemServer"</span>, cl, <span style="color: #2d9574;">"startBootstrapServices"</span>, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">XC_MethodHook</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
            @Override
            <span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #ce537a; font-weight: bold;">void</span> beforeHookedMethod<span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">MethodHookParam</span> <span style="color: #7590db;">param</span><span style="color: #2d9574;">)</span> <span style="color: #ce537a; font-weight: bold;">throws</span> <span style="color: #7590db;">Throwable</span> <span style="color: #2d9574;">{</span>
              SELinuxHelper.initForProcess<span style="color: #9cb6ad;">(</span><span style="color: #2d9574;">"android"</span><span style="color: #9cb6ad;">)</span>;
              loadedPackagesInProcess.add<span style="color: #9cb6ad;">(</span><span style="color: #2d9574;">"android"</span><span style="color: #9cb6ad;">)</span>;

              <span style="color: #ce537a; font-weight: bold;">LoadPackageParam</span> <span style="color: #7590db;">lpparam</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">LoadPackageParam</span><span style="color: #9cb6ad;">(</span>sLoadedPackageCallbacks<span style="color: #9cb6ad;">)</span>;
              lpparam.packageName = <span style="color: #2d9574;">"android"</span>;
              lpparam.processName = <span style="color: #2d9574;">"android"</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">it's actually system_server, but other functions return this as well</span>
              lpparam.classLoader = cl;
              lpparam.appInfo = null;
              lpparam.isFirstApplication = <span style="color: #a45bad;">true</span>;
              XC_LoadPackage.callAll<span style="color: #9cb6ad;">(</span>lpparam<span style="color: #9cb6ad;">)</span>;
            <span style="color: #2d9574;">}</span>
          <span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>;
        <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span><span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">when a package is loaded for an existing process, trigger the callbacks as well</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Hook&#19968;&#20010;&#36827;&#31243;&#20013;&#25152;&#26377;&#26041;&#27861;&#30340;&#26500;&#36896;&#26041;&#27861; </span>
    hookAllConstructors<span style="color: #bc6ec5;">(</span>LoadedApk.<span style="color: #4f97d7; font-weight: bold;">class</span>, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">XC_MethodHook</span><span style="color: #2d9574;">()</span> <span style="color: #2d9574;">{</span>
      @Override
      <span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #ce537a; font-weight: bold;">void</span> afterHookedMethod<span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">MethodHookParam</span> <span style="color: #7590db;">param</span><span style="color: #67b11d;">)</span> <span style="color: #ce537a; font-weight: bold;">throws</span> <span style="color: #7590db;">Throwable</span> <span style="color: #67b11d;">{</span>
        <span style="color: #ce537a; font-weight: bold;">LoadedApk</span> <span style="color: #7590db;">loadedApk</span> = <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">LoadedApk</span><span style="color: #b1951d;">)</span> param.thisObject;

        <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">packageName</span> = loadedApk.getPackageName<span style="color: #b1951d;">()</span>;
        XResources.setPackageNameForResDir<span style="color: #b1951d;">(</span>packageName, loadedApk.getResDir<span style="color: #4f97d7;">()</span><span style="color: #b1951d;">)</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>packageName.equals<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"android"</span><span style="color: #4f97d7;">)</span> || <span style="color: #a45bad;">!</span>loadedPackagesInProcess.add<span style="color: #4f97d7;">(</span>packageName<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
          <span style="color: #4f97d7; font-weight: bold;">return</span>;

        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Boolean</span><span style="color: #4f97d7;">)</span> getBooleanField<span style="color: #4f97d7;">(</span>loadedApk, <span style="color: #2d9574;">"mIncludeCode"</span><span style="color: #4f97d7;">)</span> == <span style="color: #a45bad;">false</span><span style="color: #b1951d;">)</span>
          <span style="color: #4f97d7; font-weight: bold;">return</span>;

        <span style="color: #ce537a; font-weight: bold;">LoadPackageParam</span> <span style="color: #7590db;">lpparam</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">LoadPackageParam</span><span style="color: #b1951d;">(</span>sLoadedPackageCallbacks<span style="color: #b1951d;">)</span>;
        lpparam.packageName = packageName;
        lpparam.processName = AndroidAppHelper.currentProcessName<span style="color: #b1951d;">()</span>;
        lpparam.classLoader = loadedApk.getClassLoader<span style="color: #b1951d;">()</span>;
        lpparam.appInfo = loadedApk.getApplicationInfo<span style="color: #b1951d;">()</span>;
        lpparam.isFirstApplication = <span style="color: #a45bad;">false</span>;
        XC_LoadPackage.callAll<span style="color: #b1951d;">(</span>lpparam<span style="color: #b1951d;">)</span>;
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Hook&#31995;&#32479;&#30340;ApplicationPackageManager&#26041;&#27861;</span>
    findAndHookMethod<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"android.app.ApplicationPackageManager"</span>, null, <span style="color: #2d9574;">"getResourcesForApplication"</span>,
        ApplicationInfo.<span style="color: #4f97d7; font-weight: bold;">class</span>, <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">XC_MethodHook</span><span style="color: #2d9574;">()</span> <span style="color: #2d9574;">{</span>
      @Override
      <span style="color: #4f97d7; font-weight: bold;">protected</span> <span style="color: #ce537a; font-weight: bold;">void</span> beforeHookedMethod<span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">MethodHookParam</span> <span style="color: #7590db;">param</span><span style="color: #67b11d;">)</span> <span style="color: #ce537a; font-weight: bold;">throws</span> <span style="color: #7590db;">Throwable</span> <span style="color: #67b11d;">{</span>
        <span style="color: #ce537a; font-weight: bold;">ApplicationInfo</span> <span style="color: #7590db;">app</span> = <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">ApplicationInfo</span><span style="color: #b1951d;">)</span> param.args<span style="color: #b1951d;">[</span><span style="color: #a45bad;">0</span><span style="color: #b1951d;">]</span>;
        XResources.setPackageNameForResDir<span style="color: #b1951d;">(</span>app.packageName,
          app.uid == Process.myUid<span style="color: #4f97d7;">()</span> ? app.sourceDir : app.publicSourceDir<span style="color: #b1951d;">)</span>;
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span>;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">!</span>SELinuxHelper.getAppDataFileService<span style="color: #2d9574;">()</span>.checkFileExists<span style="color: #2d9574;">(</span>BASE_DIR + <span style="color: #2d9574;">"conf/disable_resources"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
      hookResources<span style="color: #2d9574;">()</span>;
    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
      disableResources = <span style="color: #a45bad;">true</span>;
    <span style="color: #bc6ec5;">}</span>
  <span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
以上的代码中最重要的就是hook了系统的方法handleBindApplication方法.该方法是每个应用打开时必须调用的方法.所以当一个新的应用打开时,在调用handleBindApplication方法之前都会首先执行XposedBridge中的代码.
</p>
</div>
</div>
